# pandas

Pandas?
Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis"

Why Use Pandas? Pandas allows us to analyze big data and make conclusions based on statistical theories.

Pandas can clean messy data sets, and make them readable and relevant.

Relevant data is very important in data science.

In [1]:
import pandas

# series

What is a Series? A Pandas Series is like a column in a table.

It is a one-dimensional array holding data of any type.

In [12]:
import pandas as pd
b=["siva",8,5.0,True]
a=pd.Series(b)
print(a)

0    siva
1       8
2     5.0
3    True
dtype: object

In [13]:
a=[90,80,70]
b=pd.Series(a,index=['siva','kiran','chinna'])
b

siva      90
kiran     80
chinna    70
dtype: int64

In [14]:
dic={'year1':5000,'year2':60000,'year3':700000}
c=pd.Series(dic)
c

year1      5000
year2     60000
year3    700000
dtype: int64

# Data Frames

Data sets in Pandas are usually multi-dimensional tables, called DataFrames.

Series is like a column, a DataFrame is the whole table.

In [32]:
dic={'english':[80,90,70,90,75,95,80],
    'telugu':[87,94,87,74,65,94,43],
    'mathes':[88,44,88,78,98,44,82],
    'names':['siva','sankar','kavi','kavi','sankar','kiran','chinna']}
b=pd.Series(dic)
b

english                         [80, 90, 70, 90, 75, 95, 80]
telugu                          [87, 94, 87, 74, 65, 94, 43]
mathes                          [88, 44, 88, 78, 98, 44, 82]
names      [siva, sankar, kavi, kavi, sankar, kiran, chinna]
dtype: object

In [34]:
b=pd.DataFrame(dic)
b

   english  telugu  mathes   names
0       80      87      88    siva
1       90      94      44  sankar
2       70      87      88    kavi
3       90      74      78    kavi
4       75      65      98  sankar
5       95      94      44   kiran
6       80      43      82  chinna

In [19]:
b.columns

Index(['english', 'telugu', 'mathes', 'names'], dtype='object')

In [20]:
b.shape

(7, 4)

In [22]:
b.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   english  7 non-null      int64
 1   telugu   7 non-null      int64
 2   mathes   7 non-null      int64
 3   names    7 non-null      object
dtypes: int64(3), object(1)
memory usage: 352.0+ bytes

In [23]:
b.describe()

         english     telugu     mathes
count   7.000000   7.000000   7.000000
mean   77.571429  71.428571  74.142857
std    15.586930  19.016284  18.765470
min    48.000000  43.000000  44.000000
25%    72.500000  58.500000  64.500000
50%    80.000000  74.000000  78.000000
75%    87.500000  86.000000  85.000000
max    95.000000  94.000000  98.000000

In [24]:
b['english']

0    80
1    90
2    70
3    85
4    75
5    95
6    48
Name: english, dtype: int64

In [25]:
b[['telugu','english']]

   telugu  english
0      87       80
1      94       90
2      85       70
3      74       85
4      65       75
5      52       95
6      43       48

In [26]:
b.head()

   english  telugu  mathes   names
0       80      87      88    siva
1       90      94      44  sankar
2       70      85      55    kavi
3       85      74      78    ravi
4       75      65      98  ramesh

In [27]:
b.head(80)

   english  telugu  mathes   names
0       80      87      88    siva
1       90      94      44  sankar
2       70      85      55    kavi
3       85      74      78    ravi
4       75      65      98  ramesh
5       95      52      74   kiran
6       48      43      82  chinna

In [28]:
b.tail()

   english  telugu  mathes   names
2       70      85      55    kavi
3       85      74      78    ravi
4       75      65      98  ramesh
5       95      52      74   kiran
6       48      43      82  chinna

In [29]:
b.tail(3)

   english  telugu  mathes   names
4       75      65      98  ramesh
5       95      52      74   kiran
6       48      43      82  chinna

In [35]:
b['english'].value_counts()

80    2
90    2
70    1
75    1
95    1
Name: english, dtype: int64

In [37]:
b['english'].value_counts().sort_values()

70    1
75    1
95    1
80    2
90    2
Name: english, dtype: int64

In [38]:
b['english'].value_counts().sort_values(ascending=False)

80    2
90    2
70    1
75    1
95    1
Name: english, dtype: int64

In [44]:
b.loc[[0,2,5]]

   english  telugu  mathes  names
0       80      87      88   siva
2       70      87      88   kavi
5       95      94      44  kiran

In [46]:
df=pd.read_csv(r'C:\Users\asiva\OneDrive\Desktop\googleplaystore_v2.csv')

In [47]:
df.shape

(10841, 13)

In [49]:
df.head(500)

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19000.0,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14000.0,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite – FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8700.0,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25000.0,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2800.0,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up
...,...,...,...,...,...,...,...,...,...,...,...,...,...
495,Clover Dating App,DATING,4.1,11633,23000.0,"500,000+",Free,0,Mature 17+,Dating,"July 24, 2018",2.5.1,4.1 and up
496,Black People Meet Singles Date,DATING,3.9,10212,5000.0,"1,000,000+",Free,0,Mature 17+,Dating,"July 25, 2018",1.9.7,4.4 and up
497,Mingle2 - Free Online Dating & Singles Chat Rooms,DATING,4.3,37053,44000.0,"1,000,000+",Free,0,Mature 17+,Dating,"August 3, 2018",4.4B,4.1 and up
498,Free Dating App & Flirt Chat - Cheers,DATING,4.4,667,27000.0,"10,000+",Free,0,Mature 17+,Dating,"August 3, 2018",1.308.us,4.1 and up
499,stranger chat - anonymous chat,DATING,3.5,13202,6100.0,"1,000,000+",Free,0,Mature 17+,Dating,"July 7, 2018",2.4.1,4.1 and up